Revit 2026 API

# TableSectionDataSetCellStyle(TableCellStyle) Method

---

Sets a section's style

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCellStyle(
	TableCellStyle Style
)
```
```vb
Public Sub SetCellStyle (
	Style As TableCellStyle
)
```
```cpp
public:
void SetCellStyle(
	TableCellStyle^ Style
)
```
```fsharp
member SetCellStyle :
        Style : TableCellStyle -> unit
```

#### Parameters

Style TableCellStyle

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

For standard schedule, must set the TableCellStyleOverrideOptions in the TableCellStyle to override this section.

#### Reference

TableSectionData Class

SetCellStyle Overload

Autodesk.Revit.DB Namespace